app/controllers/spells_controller.rb

SELECT "spells".* FROM "spells"
---
  def index
    @spells = Spell.all

SELECT  "spells".* FROM "spells" WHERE "spells"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def set_spell
      @spell = Spell.find(params[:id])