app/models/spell.rb

SELECT  "spells".* FROM "spells" WHERE "spells"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def next
    begin
      s = Spell.find(self.id+1)

SELECT  "spells".* FROM "spells" WHERE "spells"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def previous
    begin
      s = Spell.find(self.id-1)